Revit 2027 API
AssetProperty.GetAllConnectedProperties Method
 Gets the list of the connected properties. Connected properties are the detachable properties of an AssetProperty. e.g. diffuse property can have texture as its connected property. It can also detach texture on runtime.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<AssetProperty> GetAllConnectedProperties()
Public Function GetAllConnectedProperties As IList(Of AssetProperty)
public:
IList<AssetProperty^>^ GetAllConnectedProperties()
member GetAllConnectedProperties : unit -> IList<AssetProperty>
Return Value
IList<AssetProperty>
 A list of the connected properties.
See Also
Reference
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace